#include"lanya.h"

void lanya_init(void)				//串口初始化
{
	 EA=0; //暂时关闭中断
	 TMOD&=0x0F;  //定时器1模式控制在高4位
	 TMOD|=0x20;    //定时器1工作在模式2，自动重装模式
	 SCON=0x50;     //串口工作在模式1(最常用模式)
	 TH1=0xfd;  //定时器重装值对应波特率9600	 
	 TL1=0xfd;
	 ES=1;         //串行中断允许
	 TR1=1;        //启动定时器1
	 REN=1;        //允许接收 
	 EA=1;         //允许中断
}
 /*******************************************************************************
* 函 数 名         : void uart_send(char *a)
* 函数功能		   : 蓝牙串口发送字符串
* 输    入         : 字符串指针
* 输    出         : 无
*******************************************************************************/
void uart_send(char *a)
{
	  char *b=a;
	  ES=0;  //发送时关闭中断,防止进入接收中断
	  while(*b!=0)
	  {
	  	 SBUF=*b;
		 b++;
		 while(!TI);
		 TI=0;
	  }
	  ES=1;
}